[
{
  "model": "transparency.application",
  "pk": 1,
  "fields": {
    "name": "Amazon Web Services (AWS)",
    "description": "",
    "transparency_note": "Privacy Notice\r\n\r\nThis Privacy Notice describes how we collect and use your personal information in relation to AWS websites, applications, products, services, events, and experiences that reference this Privacy Notice (together, “AWS Offerings”).\r\n\r\nThis Privacy Notice does not apply to the “content” processed, stored, or hosted by our customers using AWS Offerings in connection with an AWS account. See the agreement governing your access to your AWS account and the AWS Data Privacy FAQ for more information about how we handle content and how our customers can control their content through AWS Offerings. This Privacy Notice also does not apply to any products, services, websites, or content that are offered by third parties or have their own privacy notice.\r\n\r\nPersonal Information We Collect\r\nHow We Use Personal Information\r\nCookies\r\nHow We Share Personal Information\r\nLocation of Personal Information\r\nHow We Secure Information\r\nInternet Advertising and Third Parties\r\nAccess and Choice\r\nChildren’s Personal Information\r\nRetention of Personal Information\r\nContacts, Notices, and Revisions\r\nEU-US and Swiss-US Privacy Shield\r\nAdditional Information for Certain Jurisdictions\r\nExamples of Information Collected\r\nPersonal Information We Collect\r\nWe collect your personal information in the course of providing AWS Offerings to you.\r\n\r\nHere are the types of information we gather:\r\n\r\nInformation You Give Us: We collect any information you provide in relation to AWS Offerings. Click here to see examples of information you give us.\r\nAutomatic Information: We automatically collect certain types of information when you interact with AWS Offerings. Click here to see examples of information we collect automatically.\r\nInformation from Other Sources: We might collect information about you from other sources, including service providers, partners, and publicly available sources. Click here to see examples of information we collect from other sources.\r\nHow We Use Personal Information\r\nWe use your personal information to operate, provide, and improve AWS Offerings. Our purposes for using personal information include:\r\n\r\nProvide AWS Offerings: We use your personal information to provide and deliver AWS Offerings and process transactions related to AWS Offerings, including registrations, subscriptions, purchases, and payments.\r\nMeasure, Support, and Improve AWS Offerings: We use your personal information to measure use of, analyze performance of, fix errors in, provide support for, improve, and develop AWS Offerings.\r\nRecommendations and Personalization: We use your personal information to recommend AWS Offerings that might be of interest to you, identify your preferences, and personalize your experience with AWS Offerings.\r\nComply with Legal Obligations: In certain cases, we have a legal obligation to collect, use, or retain your personal information. For example, we collect bank account information from AWS Marketplace sellers for identity verification.\r\nCommunicate with You: We use your personal information to communicate with you in relation to AWS Offerings via different channels (e.g., by phone, email, chat) and to respond to your requests.\r\nMarketing: We use your personal information to market and promote AWS Offerings. We might display interest-based ads for AWS Offerings. To learn more, please read our Interest-Based Ads notice. \r\nFraud and Abuse Prevention and Credit Risks: We use your personal information to prevent and detect fraud and abuse in order to protect the security of our customers, AWS, and others. We may also use scoring methods to assess and manage credit risks.\r\nPurposes for Which We Seek Your Consent: We may also ask for your consent to use your personal information for a specific purpose that we communicate to you.\r\nCookies\r\nTo enable our systems to recognize your browser or device and to provide AWS Offerings, we use cookies. For more information about cookies and how we use them, please read our Cookie Notice.\r\nHow We Share Personal Information\r\nInformation about our customers is an important part of our business and we are not in the business of selling our customers’ personal information to others. We share personal information only as described below and with Amazon.com, Inc. and the subsidiaries that Amazon.com, Inc. controls that are either subject to this Privacy Notice or follow practices at least as protective as those described in this Privacy Notice.\r\n\r\nTransactions Involving Third Parties: We make available to you services, software, and content provided by third parties for use on or through AWS Offerings. You can tell when a third party is involved in your transactions, and we share information related to those transactions with that third party. For example, you can order services, software, and content from sellers using the AWS Marketplace and we provide those sellers information to facilitate your subscription, purchases, or support.\r\nThird-Party Service Providers: We employ other companies and individuals to perform functions on our behalf. Examples include: delivering AWS hardware, sending communications, processing payments, assessing credit and compliance risks, analyzing data, providing marketing and sales assistance (including advertising and event management), conducting customer relationship management, and providing training. These third party service providers have access to personal information needed to perform their functions, but may not use it for other purposes. Further, they must process that information in accordance with this Privacy Notice and as permitted by applicable data protection law.\r\nBusiness Transfers: As we continue to develop our business, we might sell or buy businesses or services. In such transactions, personal information generally is one of the transferred business assets but remains subject to the promises made in any pre-existing Privacy Notice (unless, of course, the individual consents otherwise). Also, in the unlikely event that AWS or substantially all of its assets are acquired, your information will of course be one of the transferred assets.\r\nProtection of Us and Others: We release account and other personal information when we believe release is appropriate to comply with the law, enforce or apply our terms and other agreements, or protect the rights, property, or security of AWS, our customers, or others. This includes exchanging information with other companies and organizations for fraud prevention and detection and credit risk reduction.\r\nAt Your Option: Other than as set out above, you will receive notice when personal information about you might be shared with third parties, and you will have an opportunity to choose not to share the information.\r\nLocation of Personal Information\r\nAmazon Web Services, Inc. is located in the United States, and our affiliated companies are located throughout the world. Depending on the scope of your interactions with AWS Offerings, your personal information may be stored in or accessed from multiple countries, including the United States. Whenever we transfer personal information to other jurisdictions, we will ensure that the information is transferred in accordance with this Privacy Notice and as permitted by applicable data protection laws.\r\nHow We Secure Information\r\nAt AWS, security is our highest priority. We design our systems with your security and privacy in mind.\r\n\r\nWe maintain a wide variety of compliance programs that validate our security controls. Click here to learn more about our compliance programs.\r\nWe protect the security of your information during transmission to or from AWS websites, applications, products, or services by using encryption protocols and software.\r\nWe follow the Payment Card Industry Data Security Standard (PCI DSS) when handling credit card data.\r\nWe maintain physical, electronic, and procedural safeguards in connection with the collection, storage, and disclosure of personal information. Our security procedures mean that we may request proof of identity before we disclose personal information to you.\r\nInternet Advertising and Third Parties\r\nAWS Offerings may include third-party advertising and links to other websites and applications. Third party advertising partners may collect information about you when you interact with their content, advertising, or services. For more information about third-party advertising, including interest-based ads, please read our Interest-Based Ads notice.\r\nAccess and Choice\r\nYou can view, update, and delete certain information about your account and your interactions with AWS Offerings. Click here for a list of examples of information that you can access. If you cannot access or update your information yourself, you can always contact us for assistance.\r\n\r\nYou have choices about the collection and use of your personal information. Many AWS Offerings include settings that provide you with options as to how your information is being used. You can choose not to provide certain information, but then you might not be able to take advantage of certain AWS Offerings.\r\n\r\nAccount Information: If you want to add, update, or delete information related to your account, please go to the AWS Management Console. When you update or delete any information, we usually keep a copy of the prior version for our records.\r\nCommunications: If you do not want to receive promotional messages from us, please unsubscribe or adjust your communication preferences in the AWS Management Console or the AWS Email Preference Center. If you do not want to receive in-app notifications from us, please adjust your notification settings in the app or your device.\r\nAdvertising: If you don’t want to see interest-based ads, please adjust your Advertising Preferences.\r\nBrowser and Devices: The Help feature on most browsers and devices will tell you how to prevent your browser or device from accepting new cookies, how to have the browser notify you when you receive a new cookie, or how to disable cookies altogether.\r\nSellers and Amazon Partners: Sellers and Amazon Partner Network members can add, update, or delete information in the AWS Marketplace and APN Partner Central, respectively.\r\nChildren’s Personal Information\r\nWe don’t provide AWS Offerings for purchase by children. If you’re under 18, you may use AWS Offerings only with the involvement of a parent or guardian.\r\nRetention of Personal Information\r\nWe keep your personal information to enable your continued use of AWS Offerings, for as long as it is required in order to fulfill the relevant purposes described in this Privacy Notice, as may be required by law (including for tax and accounting purposes), or as otherwise communicated to you. How long we retain specific personal information varies depending on the purpose for its use, and we will delete your personal information in accordance with applicable law.\r\nContacts, Notices, and Revisions\r\nIf you have any concern about privacy at AWS or want to contact one of our data controllers, please contact us with a thorough description, and we will try to resolve the issue for you. You may also contact us at the addresses below:\r\n\r\nFor any prospective or current customers of Amazon Web Services, Inc., our mailing address is: Amazon Web Services, Inc., 410 Terry Avenue North, Seattle, WA 98109-5210, ATTN: AWS Legal\r\nFor any prospective or current customers of Amazon Web Services EMEA SARL, our mailing address is: Amazon Web Services EMEA SARL, 38 Avenue John F. Kennedy, L-1855, Luxembourg, ATTN: AWS EMEA Legal\r\nFor any prospective or current customers of Amazon Internet Services Private Limited, our mailing address is: Amazon Internet Services Private Limited, Block E, 14th Floor, Unit Nos. 1401 to 1421, International Trade Tower, Nehru Place, New Delhi, Delhi 110019, India, ATTN: AISPL Legal\r\nIf you interact with AWS Offerings on behalf of or through your organization, then your personal information may also be subject to your organization’s privacy practices, and you should direct privacy inquiries to your organization.\r\n\r\nOur business changes constantly, and our Privacy Notice may also change. You should check our website frequently to see recent changes. You can see the date on which the latest version of this Privacy Notice was posted. Unless stated otherwise, our current Privacy Notice applies to all personal information we have about you and your account. We stand behind the promises we make, however, and will never materially change our policies and practices to make them less protective of personal information collected in the past without informing affected customers and giving them a choice.\r\nEU-US and Swiss-US Privacy Shield\r\nWe do not rely on the Privacy Shield but continue to keep to the commitments that we made when we certified to the Privacy Shield.\r\n\r\nAmazon Web Services, Inc. participates in the EU-US and Swiss-US Privacy Shield frameworks. Click here to learn more.\r\n\r\nAdditional Information for Certain Jurisdictions\r\nWe provide additional information about the privacy, collection, and use of personal information of prospective and current customers of AWS Offerings located in certain jurisdictions.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nExamples of Information Collected\r\nInformation You Give Us\r\nYou provide information to us when you:\r\n\r\nsearch for, subscribe to, or purchase AWS Offerings;\r\ncreate or administer your AWS account (and you might have more than one account if you have used more than one email address when using AWS Offerings);\r\nconfigure your settings for, provide data access permissions for, or otherwise interact with AWS Offerings; \r\nregister for or attend an AWS event;\r\npurchase or use content, products, or services from third-party providers through the AWS Marketplace (or other similar venues operated or provided by us);\r\noffer your content, products, or services on or through AWS Offerings or the AWS Marketplace (or other similar venues operated or provided by us);\r\ncommunicate with us by phone, email, or otherwise; \r\ncomplete a questionnaire, a support ticket, or other information request forms; \r\npost on AWS websites or participate in community features; and\r\nemploy notification services.\r\nDepending on your use of AWS Offerings, you might supply us with such information as:\r\n\r\nyour name, email address, physical address, phone number, and other similar contact information;\r\npayment information, including credit card and bank account information;\r\ninformation about your location;\r\ninformation about your organization and your contacts, such as colleagues or people within your organization;\r\nusernames, aliases, roles, and other authentication and security credential information;\r\ncontent of feedback, testimonials, inquiries, support tickets, and any phone conversations, chat sessions and emails with or to us; \r\nyour image (still, video, and in some cases 3-D), voice, and other identifiers that are personal to you when you attend an AWS event or use certain AWS Offerings;\r\ninformation regarding identity, including government-issued identification information; \r\ncorporate and financial information; and\r\nVAT numbers and other tax identifiers.\r\nAutomatic Information\r\nWe collect information automatically when you:\r\n\r\nvisit, interact with, or use AWS Offerings (including when you use your computer or other device to interact with AWS Offerings); \r\ndownload content from us;\r\nopen emails or click on links in emails from us; and\r\ninteract or communicate with us (such as when you attend an AWS event or when you request customer support).\r\nExamples of the information we automatically collect include:\r\n\r\nnetwork and connection information, such as the Internet protocol (IP) address used to connect your computer or other device to the Internet and information about your Internet service provider; \r\ncomputer and device information, such as device, application, or browser type and version, browser plug-in type and version, operating system, or time zone setting; \r\nthe location of your device or computer;\r\nauthentication and security credential information;\r\ncontent interaction information, such as content downloads, streams, and playback details, including duration and number of simultaneous streams and downloads; \r\nAWS Offerings metrics, such as offering usage, occurrences of technical errors, diagnostic reports, your settings preferences, backup information, API calls, and other logs; \r\nthe full Uniform Resource Locators (URL) clickstream to, through, and from our website (including date and time) and AWS Offerings, content you viewed or searched for, page response times, download errors, and page interaction information (such as scrolling, clicks, and mouse-overs);\r\nemail addresses and phone numbers used to contact us; and\r\nidentifiers and information contained in cookies (see our Cookie Notice).  \r\nInformation from Other Sources\r\nExamples of information we receive from other sources include:\r\n\r\nmarketing, sales generation, and recruitment information, including your name, email address, physical address, phone number, and other similar contact information; \r\nsubscription, purchase, support, or other information about your interactions with products and services offered by us, our affiliates (such as AWS training courses), or third parties (such as products offered through the AWS Marketplace) in relation to AWS Offerings; \r\nsearch results and links, including paid listings (such as Sponsored Links); and \r\ncredit history information from credit bureaus.\r\nInformation You Can Access\r\nExamples of information you can access through AWS Offerings include:\r\n\r\nyour name, email address, physical address, phone number, and other similar contact information; \r\nusernames, aliases, roles, and other authentication and security credential information;\r\nyour subscription, purchase, usage, billing, and payment history; \r\npayment settings, such as payment instrument information and billing preferences;\r\ntax information; \r\nemail communication and notification settings; and \r\nif you participate in the AWS Marketplace or Amazon Partner Network (or other similar venues operated or provided by us), your account, your status, subscriptions, and other information.\r\nCustomers can access the information above through AWS Offerings, such as the AWS Management Console (including the My Account, Billing Dashboard, Bills, Payment Methods, Payment History, Preferences, and Tax Settings pages), the AWS Email Preference Center, AWS Marketplace, and APN Partner Central."
  }
},
{
  "model": "transparency.application",
  "pk": 2,
  "fields": {
    "name": "WhatsApp",
    "description": null,
    "transparency_note": null
  }
},
{
  "model": "transparency.application",
  "pk": 3,
  "fields": {
    "name": "test56",
    "description": "",
    "transparency_note": ""
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 1,
  "fields": {
    "label": "S003",
    "name": "Amazon web services team",
    "description": "",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 2,
  "fields": {
    "label": "S004",
    "name": "Customer",
    "description": "",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 3,
  "fields": {
    "label": "S001",
    "name": "Customers",
    "description": null,
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 4,
  "fields": {
    "label": "S002",
    "name": "WhatsApp team",
    "description": null,
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 5,
  "fields": {
    "label": "S001",
    "name": "Amazon company",
    "description": "We created this introduction notebook to guide you through your first steps in exploring and visualizing data with Observable. It’s all yours to edit, tinker with, and return to as needed.",
    "application": 1,
    "weight": 1
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 6,
  "fields": {
    "label": "S002",
    "name": "Third-party service providers",
    "description": null,
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 7,
  "fields": {
    "label": "S003",
    "name": "Facebook company",
    "description": null,
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 8,
  "fields": {
    "label": "S004",
    "name": "Third-party entities",
    "description": null,
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.stakeholder",
  "pk": 16,
  "fields": {
    "label": "S001",
    "name": "test",
    "description": "",
    "application": 3,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 1,
  "fields": {
    "label": "D003",
    "name": "Personal information (PI)",
    "description": "This information element contains the customer’s personal information. This includes name, email address, physical address, phone number, and other similar contact information, payment information, including credit card and bank account information, and more.",
    "type": "data",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 2,
  "fields": {
    "label": "R001",
    "name": "Collection of personal information",
    "description": "This information element contains how the AWS team collects information about customers, using the information provided by them, automatic information, or information from public sources.",
    "type": "process",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 3,
  "fields": {
    "label": "P001",
    "name": "Purpose for using personal information",
    "description": "This Information element contains the main purposes for using the customer’s personal information, which is to provide AWS offerings, measure, support, and improve the offerings, for marketing purposes and recommendations.",
    "type": "policy",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 4,
  "fields": {
    "label": "P002",
    "name": "Cookies",
    "description": "This information element explains why the AWS website needs to use cookies.",
    "type": "policy",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 5,
  "fields": {
    "label": "P003",
    "name": "Sharing of personal information",
    "description": "This information element contains how personal information sharing works, AWS uses other third parties service providers but they make sure that personal information is secure and shares only related data.",
    "type": "policy",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 6,
  "fields": {
    "label": "D001",
    "name": "Location of personal information",
    "description": "This information element contains the location of the customer’s personal information.",
    "type": "data",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 7,
  "fields": {
    "label": "R002",
    "name": "Security of personal information",
    "description": "This information element talks about how personal information is being secured and encrypted, and how the AWS team makes sure that it is safe and protected, especially sensitive information like credit cards.",
    "type": "process",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 8,
  "fields": {
    "label": "D002",
    "name": "Children’s PI",
    "description": "This information element says that AWS offerings are not meant for children. If a customer is under 18, only with the intervention of a parent or guardian can he use AWS Offers?",
    "type": "data",
    "application": 1,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 9,
  "fields": {
    "label": "D003",
    "name": "Personal messages",
    "description": "Customers provide messages as data",
    "type": "data",
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 10,
  "fields": {
    "label": "D001",
    "name": "WhatsApp's end-to-end message encryption system",
    "description": "What kind of security is provided in sending messages with Whatsapp?",
    "type": "data",
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 11,
  "fields": {
    "label": "R001",
    "name": "Procedure of encrypting messages",
    "description": "How Whatsapp encrypt messages? with a lock and only the recipient of the messages can unlock and read them using a special key, all of this is an automatic process",
    "type": "process",
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 12,
  "fields": {
    "label": "P001",
    "name": "Purpose of using end-to-end encryption",
    "description": "Why Whatsapp uses end-to-end encryption? To ensure the security and the integrity of their customers",
    "type": "policy",
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 13,
  "fields": {
    "label": "D004",
    "name": "Payment information provided by the customer",
    "description": "",
    "type": "data",
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 14,
  "fields": {
    "label": "R002",
    "name": "Payment information (Card and bank numbers) security",
    "description": "How customers payment information are stored? stored encrypted and in a highly-secured network",
    "type": "process",
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 15,
  "fields": {
    "label": "D002",
    "name": "Location of end-to-end encrypted messages",
    "description": "What is the location of the customer’s messages? End-to-end encrypted messages are stored on your device and not on WhatsApp servers after they are delivered",
    "type": "data",
    "application": 2,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 39,
  "fields": {
    "label": "D001",
    "name": "test",
    "description": "",
    "type": "data",
    "application": 3,
    "weight": 0
  }
},
{
  "model": "transparency.informationelement",
  "pk": 40,
  "fields": {
    "label": "R001",
    "name": "test2",
    "description": "",
    "type": "process",
    "application": 3,
    "weight": 0
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 1,
  "fields": {
    "stakeholder": 2,
    "information_element": 1,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 2,
  "fields": {
    "stakeholder": 1,
    "information_element": 2,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 3,
  "fields": {
    "stakeholder": 1,
    "information_element": 3,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 4,
  "fields": {
    "stakeholder": 1,
    "information_element": 4,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 5,
  "fields": {
    "stakeholder": 1,
    "information_element": 5,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 6,
  "fields": {
    "stakeholder": 1,
    "information_element": 6,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 9,
  "fields": {
    "stakeholder": 1,
    "information_element": 7,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 10,
  "fields": {
    "stakeholder": 1,
    "information_element": 8,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 11,
  "fields": {
    "stakeholder": 1,
    "information_element": 1,
    "type": "optional"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 12,
  "fields": {
    "stakeholder": 2,
    "information_element": 2,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 13,
  "fields": {
    "stakeholder": 2,
    "information_element": 3,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 14,
  "fields": {
    "stakeholder": 2,
    "information_element": 4,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 15,
  "fields": {
    "stakeholder": 2,
    "information_element": 5,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 16,
  "fields": {
    "stakeholder": 2,
    "information_element": 6,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 17,
  "fields": {
    "stakeholder": 2,
    "information_element": 7,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 18,
  "fields": {
    "stakeholder": 2,
    "information_element": 8,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 19,
  "fields": {
    "stakeholder": 5,
    "information_element": 1,
    "type": "optional"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 20,
  "fields": {
    "stakeholder": 6,
    "information_element": 1,
    "type": "optional"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 21,
  "fields": {
    "stakeholder": 6,
    "information_element": 5,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 22,
  "fields": {
    "stakeholder": 5,
    "information_element": 5,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 23,
  "fields": {
    "stakeholder": 3,
    "information_element": 9,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 24,
  "fields": {
    "stakeholder": 4,
    "information_element": 10,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 25,
  "fields": {
    "stakeholder": 4,
    "information_element": 11,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 26,
  "fields": {
    "stakeholder": 4,
    "information_element": 12,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 27,
  "fields": {
    "stakeholder": 4,
    "information_element": 13,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 28,
  "fields": {
    "stakeholder": 4,
    "information_element": 14,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 29,
  "fields": {
    "stakeholder": 4,
    "information_element": 15,
    "type": "production"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 30,
  "fields": {
    "stakeholder": 3,
    "information_element": 10,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 31,
  "fields": {
    "stakeholder": 3,
    "information_element": 11,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 32,
  "fields": {
    "stakeholder": 3,
    "information_element": 12,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 33,
  "fields": {
    "stakeholder": 3,
    "information_element": 13,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 34,
  "fields": {
    "stakeholder": 3,
    "information_element": 14,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 35,
  "fields": {
    "stakeholder": 3,
    "information_element": 15,
    "type": "obligatory"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 36,
  "fields": {
    "stakeholder": 7,
    "information_element": 9,
    "type": "optional"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 37,
  "fields": {
    "stakeholder": 8,
    "information_element": 9,
    "type": "optional"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 38,
  "fields": {
    "stakeholder": 6,
    "information_element": 1,
    "type": "restricted"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 39,
  "fields": {
    "stakeholder": 6,
    "information_element": 4,
    "type": "restricted"
  }
},
{
  "model": "transparency.stakeholderinformationrelationship",
  "pk": 40,
  "fields": {
    "stakeholder": 16,
    "information_element": 39,
    "type": "restricted"
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 1,
  "fields": {
    "source": 9,
    "target": 10
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 2,
  "fields": {
    "source": 9,
    "target": 11
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 3,
  "fields": {
    "source": 9,
    "target": 12
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 4,
  "fields": {
    "source": 9,
    "target": 15
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 5,
  "fields": {
    "source": 13,
    "target": 14
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 6,
  "fields": {
    "source": 1,
    "target": 2
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 7,
  "fields": {
    "source": 1,
    "target": 3
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 8,
  "fields": {
    "source": 1,
    "target": 5
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 9,
  "fields": {
    "source": 1,
    "target": 6
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 10,
  "fields": {
    "source": 1,
    "target": 7
  }
},
{
  "model": "transparency.informationelementassociation",
  "pk": 12,
  "fields": {
    "source": 39,
    "target": 40
  }
}
]
